openfoam_templates/validation_reacting_iso_octane_case/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     rhoPimpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.0003;
deltaT          0.0001;
writeControl    timeStep;
writeInterval   1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    residualTracerTransport
    {
        type            scalarTransport;
        libs            ("libsolverFunctionObjects.so");
        field           residualTracer;
        phi             phi;
        rho             rho;
        diffusivity     none;
        nCorr           1;
        bounded01       true;
        resetOnStartUp  false;
        writeControl    writeTime;
    }
}
