openfoam_templates/validation_reacting_iso_octane_case/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions ();
